firefoamcases/cases/wallFireSpread2D/0/nut
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  dev                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/

FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object          nut;
}

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //


dimensions      [0 2 -1 0 0 0 0];

internalField   uniform 0;

boundaryField
{
    solid           
    {
        //type            zeroGradient;
        //type            muSgsWallFunction;
        type            fixedValue;
        value		uniform 0;
    }

    outlet          
    {
        type            zeroGradient;
    }
    ground           
    {
        type            zeroGradient;
    }
    frontAndBack
    {
        type            empty;
    }
    side
    {
        type            zeroGradient;
    }
    burner          
    {
        type            zeroGradient;
    }
    region0_to_panelRegion_panel
    {
        //type            zeroGradient;
        //type            muSgsWallFunction;
        type            fixedValue;
        value		uniform 0;
    }

}


// ************************************************************************* //
